[
  {
    "subjectId": "2110523",
    "subjectName": "SOFTWARE ARCHITECTURES2",
    "subjectDescription": "Principles of software architectures; practical methods in software architectures using scenario-based analysis, heuristic, and formal approaches; architectural styles; architectural description language; software architectural analysis and design; software architectures specification tools; software architecture-based testing; use of software architectures in the software development process.",
    "credits": 3,
    "semester": 1,
    "year": 2024,
    "isOpen": true,
    "date": ["Mon", "Wed", "Fri"],
    "startTime": "09:00",
    "endTime": "10:30",
    "sec": 1
  },
  {
    "subjectId": "2110524",
    "subjectName": "DATA STRUCTURES AND ALGORITHMS",
    "subjectDescription": "Introduction to data structures and algorithms; arrays, stacks, queues, linked lists, trees, graphs; searching and sorting algorithms; algorithmic complexity; recursive algorithms; applications of data structures in software development.",
    "credits": 3,
    "semester": 2,
    "year": 2024,
    "isOpen": true,
    "date": ["Tue", "Thu"],
    "startTime": "10:00",
    "endTime": "11:30",
    "sec": 2
  },
  {
    "subjectId": "2110530",
    "subjectName": "DATABASE SYSTEMS",
    "subjectDescription": "Fundamentals of database systems; relational databases; SQL programming; database design using ER models; normalization techniques; transaction management; indexing and query optimization; NoSQL databases and big data concepts.",
    "credits": 4,
    "semester": 1,
    "year": 2024,
    "isOpen": false,
    "date": ["Mon", "Wed"],
    "startTime": "13:00",
    "endTime": "14:30",
    "sec": 1
  },
  {
    "subjectId": "2110540",
    "subjectName": "OPERATING SYSTEMS",
    "subjectDescription": "Concepts of operating systems; process management, memory management, file systems, I/O systems, and security; concurrency and synchronization mechanisms; virtualization and cloud computing; case studies of modern operating systems.",
    "credits": 3,
    "semester": 2,
    "year": 2024,
    "isOpen": true,
    "date": ["Mon", "Fri"],
    "startTime": "08:30",
    "endTime": "10:00",
    "sec": 3
  }
]
